WSDL/WebMethodLogin.xml

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:ns="http://ws.apache.org/axis2" xmlns:ax23="http://rpc.xml.coldfusion/xsd" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:ns1="http://org.apache.axis2/xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" targetNamespace="http://ws.apache.org/axis2">
    <wsdl:types>
        <xs:schema xmlns:ax24="http://rpc.xml.coldfusion/xsd" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://ws.apache.org/axis2">
            <xs:import namespace="http://rpc.xml.coldfusion/xsd"/>
            <xs:element name="hpih_uat.web_services.authentication.login.cfcCFCInvocationException">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="CFCInvocationException" nillable="true" type="ax24:CFCInvocationException"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="login">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="company_code" nillable="true" type="xs:string"/>
                        <xs:element minOccurs="0" name="system_code" nillable="true" type="xs:string"/>
                        <xs:element minOccurs="0" name="password" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="loginResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="return" nillable="true" type="xs:string"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:complexType name="document">
                <xs:sequence>
                    <xs:any/>
                </xs:sequence>
            </xs:complexType>
        </xs:schema>
        <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://rpc.xml.coldfusion/xsd">
            <xs:complexType name="CFCInvocationException">
                <xs:sequence/>
            </xs:complexType>
            <xs:complexType name="StructDelegate">
                <xs:sequence>
                    <xs:element maxOccurs="unbounded" minOccurs="0" name="entries" nillable="true" type="ax23:EntryDelegate"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="EntryDelegate">
                <xs:sequence>
                    <xs:element minOccurs="0" name="key" nillable="true" type="xs:anyType"/>
                    <xs:element minOccurs="0" name="value" nillable="true" type="xs:anyType"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="QueryBean">
                <xs:sequence>
                    <xs:element maxOccurs="unbounded" minOccurs="0" name="columnList" nillable="true" type="xs:string"/>
                    <xs:element maxOccurs="unbounded" minOccurs="0" name="data" nillable="true" type="ax23:ArrayOfObject"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="ArrayOfObject">
                <xs:sequence>
                    <xs:element maxOccurs="unbounded" minOccurs="0" name="array" nillable="true" type="xs:anyType"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="DocumentDelegate">
                <xs:sequence>
                    <xs:element minOccurs="0" name="document" nillable="true" type="ns:document"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="ArrayDelegate">
                <xs:sequence>
                    <xs:element maxOccurs="unbounded" minOccurs="0" name="array" nillable="true" type="xs:anyType"/>
                </xs:sequence>
            </xs:complexType>
        </xs:schema>
    </wsdl:types>
    <wsdl:message name="loginRequest">
        <wsdl:part name="parameters" element="ns:login"/>
    </wsdl:message>
    <wsdl:message name="loginResponse">
        <wsdl:part name="parameters" element="ns:loginResponse"/>
    </wsdl:message>
    <wsdl:message name="hpih_uat.web_services.authentication.login.cfcCFCInvocationException">
        <wsdl:part name="parameters" element="ns:hpih_uat.web_services.authentication.login.cfcCFCInvocationException"/>
    </wsdl:message>
    <wsdl:portType name="hpih_uat.web_services.authentication.login.cfcPortType">
        <wsdl:operation name="login">
            <wsdl:input message="ns:loginRequest" wsaw:Action="urn:login"/>
            <wsdl:output message="ns:loginResponse" wsaw:Action="urn:loginResponse"/>
            <wsdl:fault message="ns:hpih_uat.web_services.authentication.login.cfcCFCInvocationException" name="hpih_uat.web_services.authentication.login.cfcCFCInvocationException" wsaw:Action="urn:loginhpih_uat.web_services.authentication.login.cfcCFCInvocationException"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="hpih_uat.web_services.authentication.login.cfcSoap11Binding" type="ns:hpih_uat.web_services.authentication.login.cfcPortType">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <wsdl:operation name="login">
            <soap:operation soapAction="urn:login" style="document"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
            <wsdl:fault name="hpih_uat.web_services.authentication.login.cfcCFCInvocationException">
                <soap:fault use="literal" name="hpih_uat.web_services.authentication.login.cfcCFCInvocationException"/>
            </wsdl:fault>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:binding name="hpih_uat.web_services.authentication.login.cfcSoap12Binding" type="ns:hpih_uat.web_services.authentication.login.cfcPortType">
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <wsdl:operation name="login">
            <soap12:operation soapAction="urn:login" style="document"/>
            <wsdl:input>
                <soap12:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal"/>
            </wsdl:output>
            <wsdl:fault name="hpih_uat.web_services.authentication.login.cfcCFCInvocationException">
                <soap12:fault use="literal" name="hpih_uat.web_services.authentication.login.cfcCFCInvocationException"/>
            </wsdl:fault>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="hpih_uat.web_services.authentication.login.cfc">
        <wsdl:port name="hpih_uat.web_services.authentication.login.cfcHttpSoap11Endpoint" binding="ns:hpih_uat.web_services.authentication.login.cfcSoap11Binding">
            <soap:address location="http://hpuat01:80/hpih_uat/web_services/authentication/login.cfc"/>
        </wsdl:port>
        <wsdl:port name="hpih_uat.web_services.authentication.login.cfcHttpSoap12Endpoint" binding="ns:hpih_uat.web_services.authentication.login.cfcSoap12Binding">
            <soap12:address location="http://hpuat01:80/hpih_uat/web_services/authentication/login.cfc"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>

 
  
  